# ‚¨áÔ∏è Imaport Libraries

In [86]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Read üìñ Datasets üóÉÔ∏è & Analysis üîç of JD.com

### Reading JD_order_data.csv üìÅ table from dataset

In [3]:
df_order =  pd.read_csv('data\JD_order_data.csv')

#### *Simple üïµÔ∏èüïµÔ∏è‚Äç‚ôÄÔ∏è Quality & Descriptive Analysis on the table*

In [4]:
df_order.head()

,order_ID,user_ID,sku_ID,order_date,order_time,quantity,type,promise,original_unit_price,final_unit_price,direct_discount_per_unit,quantity_discount_per_unit,bundle_discount_per_unit,coupon_discount_per_unit,gift_item,dc_ori,dc_des
0,d0cf5cc6db,0abe9ef2ce,581d5b54c1,2018-03-01,2018-03-01 17:14:25.0,1,2,-,89.0,79.0,0.0,10.0,0.0,0.0,0,4,28
1,7444318d01,33a9e56257,067b673f2b,2018-03-01,2018-03-01 11:10:40.0,1,1,2,99.9,53.9,5.0,41.0,0.0,0.0,0,28,28
2,f973b01694,4ea3cf408f,623d0a582a,2018-03-01,2018-03-01 09:13:26.0,1,1,2,78.0,58.5,19.5,0.0,0.0,0.0,0,28,28
3,8c1cec8d4b,b87cb736cb,fc5289b139,2018-03-01,2018-03-01 21:29:50.0,1,1,2,61.0,35.0,0.0,26.0,0.0,0.0,0,4,28
4,d43a33c38a,4829223b6f,623d0a582a,2018-03-01,2018-03-01 19:13:37.0,1,1,1,78.0,53.0,19.0,0.0,0.0,6.0,0,3,16

In [5]:
df_order.dtypes

order_ID                       object
user_ID                        object
sku_ID                         object
order_date                     object
order_time                     object
quantity                        int64
type                            int64
promise                        object
original_unit_price           float64
final_unit_price              float64
direct_discount_per_unit      float64
quantity_discount_per_unit    float64
bundle_discount_per_unit      float64
coupon_discount_per_unit      float64
gift_item                       int64
dc_ori                          int64
dc_des                          int64
dtype: object

In [6]:
df_order.describe()

,quantity,type,original_unit_price,final_unit_price,direct_discount_per_unit,quantity_discount_per_unit,bundle_discount_per_unit,coupon_discount_per_unit,gift_item,dc_ori,dc_des
count,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000
mean,1.216670,1.499139,102.813542,71.572599,19.845889,7.843390,0.625649,2.926015,0.172014,12.062714,21.679845
std,1.844589,0.500000,95.035563,75.879057,33.593536,17.994354,6.442281,11.588338,0.377393,14.201200,16.973899
min,1.000000,1.000000,0.000000,-32.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000
25%,1.000000,1.000000,59.000000,33.000000,0.000000,0.000000,0.000000,0.000000,0.000000,4.000000,5.000000
50%,1.000000,1.000000,79.000000,58.000000,4.000000,0.000000,0.000000,0.000000,0.000000,7.000000,20.000000
75%,1.000000,2.000000,139.000000,95.000000,21.000000,0.000000,0.000000,0.000000,0.000000,10.000000,34.000000
max,400.000000,2.000000,12158.000000,12158.000000,720.000000,225.000000,252.000000,210.000000,1.000000,67.000000,67.000000

In [7]:
df_order.duplicated().sum()

3928

In [8]:
df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549989 entries, 0 to 549988
Data columns (total 17 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   order_ID                    549989 non-null  object
 1   user_ID                     549989 non-null  object
 2   sku_ID                      549989 non-null  object
 3   order_date                  549989 non-null  object
 4   order_time                  549989 non-null  object
 5   quantity                    549989 non-null  int64
 6   type                        549989 non-null  int64
 7   promise                     549989 non-null  object
 8   original_unit_price         549989 non-null  float64
 9   final_unit_price            549989 non-null  float64
 10  direct_discount_per_unit    549989 non-null  float64
 11  quantity_discount_per_unit  549989 non-null  float64
 12  bundle_discount_per_unit    549989 non-null  float64
 13  coupon_discount_per_unit    549989 non-null  float64
 14  gift_item                   549989 non-null  int64
 15  dc_ori                      549989 non-null  int64
 16  dc_des                      549989 non-null  int64
dtypes: float64(6), int64(5), object(6)
memory usage: 71.3+ MB

##### üîç Find Inconsistency

In [9]:
df_obj_sku = df_order.select_dtypes(include="object")

In [10]:
df_obj_sku.isin(['-']).sum()

order_ID           0
user_ID            0
sku_ID             0
order_date         0
order_time         0
promise       208583
dtype: int64

##### Fixing the inconsistency present in the data ü™õ

In [11]:
df_order.replace('-',np.nan,inplace=True)

### Reading JD_sku_data.csv üìÅ table from dataset

In [26]:
df_sku =  pd.read_csv('data\JD_sku_data.csv')

#### *Simple üïµÔ∏èüïµÔ∏è‚Äç‚ôÄÔ∏è Quality & Descriptive Analysis on the table*

In [27]:
df_sku.head()

,sku_ID,type,brand_ID,attribute1,attribute2,activate_date,deactivate_date
0,a234e08c57,1,c3ab4bf4d9,3.0,60.0,NaN,NaN
1,6449e1fd87,1,1d8b4b4c63,2.0,50.0,NaN,NaN
2,09b70fcd83,2,eb7d2a675a,3.0,70.0,NaN,NaN
3,acad9fed04,2,9b0d3a5fc6,3.0,70.0,NaN,NaN
4,2fa77e3b4d,2,b681299668,-,-,NaN,NaN

In [28]:
df_obj_sku = df_sku.select_dtypes(include="object")

In [29]:
df_obj_sku.isin(['-']).sum()

sku_ID                 0
brand_ID               0
attribute1         15961
attribute2         17319
activate_date          0
deactivate_date        0
dtype: int64

In [30]:
df_sku.replace('-',np.nan,inplace=True)

In [31]:
df_sku.describe()

               type
count  31868.000000
mean       1.963380
std        0.187829
min        1.000000
25%        2.000000
50%        2.000000
75%        2.000000
max        2.000000

In [32]:
df_sku.duplicated().sum()

0

In [33]:
df_sku.dtypes

sku_ID             object
type                int64
brand_ID           object
attribute1         object
attribute2         object
activate_date      object
deactivate_date    object
dtype: object

In [34]:
df_sku.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31868 entries, 0 to 31867
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   sku_ID           31868 non-null  object
 1   type             31868 non-null  int64
 2   brand_ID         31868 non-null  object
 3   attribute1       15907 non-null  object
 4   attribute2       14549 non-null  object
 5   activate_date    3058 non-null   object
 6   deactivate_date  1141 non-null   object
dtypes: int64(1), object(6)
memory usage: 1.7+ MB

### Reading JD_user_data.csv üìÅ table from dataset

In [36]:
df_user =  pd.read_csv('data/JD_user_data.csv')

#### *Simple üïµÔ∏èüïµÔ∏è‚Äç‚ôÄÔ∏è Quality & Descriptive Analysis on the table*

In [20]:
df_user.head()

,user_ID,user_level,first_order_month,plus,gender,age,marital_status,education,city_level,purchase_power
0,000089d6a6,1,2017-08,0,F,26-35,S,3,4,3
1,0000babd1f,1,2018-03,0,U,U,U,-1,-1,-1
2,0000bc018b,3,2016-06,0,F,>=56,M,3,2,3
3,0000d0e5ab,3,2014-06,0,M,26-35,M,3,2,2
4,0000dce472,3,2012-08,1,U,U,U,-1,-1,-1

In [21]:
df_user.dtypes

user_ID              object
user_level            int64
first_order_month    object
plus                  int64
gender               object
age                  object
marital_status       object
education             int64
city_level            int64
purchase_power        int64
dtype: object

In [22]:
df_user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457298 entries, 0 to 457297
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_ID            457298 non-null  object
 1   user_level         457298 non-null  int64
 2   first_order_month  457298 non-null  object
 3   plus               457298 non-null  int64
 4   gender             457298 non-null  object
 5   age                457298 non-null  object
 6   marital_status     457298 non-null  object
 7   education          457298 non-null  int64
 8   city_level         457298 non-null  int64
 9   purchase_power     457298 non-null  int64
dtypes: int64(5), object(5)
memory usage: 34.9+ MB

In [133]:
df_user['first_order_month'].sample(20)

229562    2015-11
282581    2017-03
389029    2015-06
276388    2015-05
64324     2018-03
323776    2018-03
184128    2014-05
259874    2016-06
317264    2016-11
353088    2016-08
428722    2010-06
268974    2017-11
301933    2017-10
195853    2017-11
420591    2012-05
287542    2016-06
95699     2014-05
433994    2017-06
377818    2017-06
106413    2014-12
Name: first_order_month, dtype: object

# Data Cleaing/Processing üßπ/üîÅ

### Data Cleaning/Processig JD_order_data.csv

In [41]:
df_order.head()

,order_ID,user_ID,sku_ID,order_date,order_time,quantity,type,promise,original_unit_price,final_unit_price,direct_discount_per_unit,quantity_discount_per_unit,bundle_discount_per_unit,coupon_discount_per_unit,gift_item,dc_ori,dc_des
0,d0cf5cc6db,0abe9ef2ce,581d5b54c1,2018-03-01,2018-03-01 17:14:25.0,1,2,NaN,89.0,79.0,0.0,10.0,0.0,0.0,0,4,28
1,7444318d01,33a9e56257,067b673f2b,2018-03-01,2018-03-01 11:10:40.0,1,1,2,99.9,53.9,5.0,41.0,0.0,0.0,0,28,28
2,f973b01694,4ea3cf408f,623d0a582a,2018-03-01,2018-03-01 09:13:26.0,1,1,2,78.0,58.5,19.5,0.0,0.0,0.0,0,28,28
3,8c1cec8d4b,b87cb736cb,fc5289b139,2018-03-01,2018-03-01 21:29:50.0,1,1,2,61.0,35.0,0.0,26.0,0.0,0.0,0,4,28
4,d43a33c38a,4829223b6f,623d0a582a,2018-03-01,2018-03-01 19:13:37.0,1,1,1,78.0,53.0,19.0,0.0,0.0,6.0,0,3,16

#### Handling Missing Values ‚õî

In [42]:
df_order.isna().sum()

order_ID                           0
user_ID                            0
sku_ID                             0
order_date                         0
order_time                         0
quantity                           0
type                               0
promise                       208583
original_unit_price                0
final_unit_price                   0
direct_discount_per_unit           0
quantity_discount_per_unit         0
bundle_discount_per_unit           0
coupon_discount_per_unit           0
gift_item                          0
dc_ori                             0
dc_des                             0
dtype: int64

The col Promise is the expected delivery date the a packge that has to be delivered expected delivery time of the company is 2 or less so null entries are consider to be more than 2 so be 3 in common

In [47]:
df_order['promise'].fillna('3',inplace=True)
df_order['promise'] = df_order['promise'].astype(int)

#### Reordering order data into order_date order_time and order_day üóìÔ∏è

In [55]:
df_order['order_date'] = pd.to_datetime(df_order['order_date'])
df_order['order_time'] = pd.to_datetime(df_order['order_time'])

In [62]:
df_order['order_day'] = df_order['order_date'].dt.day_of_week
df_order['order_date'] = df_order['order_time'].dt.date
df_order['order_time'] = df_order['order_time'].dt.time

In [73]:
df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549989 entries, 0 to 549988
Data columns (total 18 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   order_ID                    549989 non-null  object
 1   user_ID                     549989 non-null  object
 2   sku_ID                      549989 non-null  object
 3   order_date                  549989 non-null  object
 4   order_time                  549989 non-null  object
 5   quantity                    549989 non-null  int64
 6   type                        549989 non-null  int64
 7   promise                     549989 non-null  int32
 8   original_unit_price         549989 non-null  float64
 9   final_unit_price            549989 non-null  float64
 10  direct_discount_per_unit    549989 non-null  float64
 11  quantity_discount_per_unit  549989 non-null  float64
 12  bundle_discount_per_unit    549989 non-null  float64
 13  coupon_discount_per_unit    549989 non-null  float64
 14  gift_item                   549989 non-null  int64
 15  dc_ori                      549989 non-null  int64
 16  dc_des                      549989 non-null  int64
 17  order_day                   549989 non-null  int64
dtypes: float64(6), int32(1), int64(6), object(5)
memory usage: 73.4+ MB

In [69]:
df_order.head()

,order_ID,user_ID,sku_ID,order_date,order_time,quantity,type,promise,original_unit_price,final_unit_price,direct_discount_per_unit,quantity_discount_per_unit,bundle_discount_per_unit,coupon_discount_per_unit,gift_item,dc_ori,dc_des,order_day
0,d0cf5cc6db,0abe9ef2ce,581d5b54c1,2018-03-01,17:14:25,1,2,3,89.0,79.0,0.0,10.0,0.0,0.0,0,4,28,3
1,7444318d01,33a9e56257,067b673f2b,2018-03-01,11:10:40,1,1,2,99.9,53.9,5.0,41.0,0.0,0.0,0,28,28,3
2,f973b01694,4ea3cf408f,623d0a582a,2018-03-01,09:13:26,1,1,2,78.0,58.5,19.5,0.0,0.0,0.0,0,28,28,3
3,8c1cec8d4b,b87cb736cb,fc5289b139,2018-03-01,21:29:50,1,1,2,61.0,35.0,0.0,26.0,0.0,0.0,0,4,28,3
4,d43a33c38a,4829223b6f,623d0a582a,2018-03-01,19:13:37,1,1,1,78.0,53.0,19.0,0.0,0.0,6.0,0,3,16,3

### Data Cleaning/Processig JD_sku_data.csv

In [74]:
df_sku.head()

,sku_ID,type,brand_ID,attribute1,attribute2,activate_date,deactivate_date
0,a234e08c57,1,c3ab4bf4d9,3.0,60.0,NaN,NaN
1,6449e1fd87,1,1d8b4b4c63,2.0,50.0,NaN,NaN
2,09b70fcd83,2,eb7d2a675a,3.0,70.0,NaN,NaN
3,acad9fed04,2,9b0d3a5fc6,3.0,70.0,NaN,NaN
4,2fa77e3b4d,2,b681299668,NaN,NaN,NaN,NaN

In [76]:
df_sku['attribute1'].fillna('0.0',inplace = True)
df_sku['attribute2'].fillna('0.0',inplace = True)
df_sku['attribute1'] = df_sku['attribute1'].astype(float)
df_sku['attribute2'] = df_sku['attribute2'].astype(float)

In [78]:
df_sku['activate_date'].unique()

array([nan, '2018-03-01', '2018-03-02', '2018-03-03', '2018-03-04',
       '2018-03-05', '2018-03-06', '2018-03-07', '2018-03-08',
       '2018-03-09', '2018-03-10', '2018-03-11', '2018-03-12',
       '2018-03-13', '2018-03-14', '2018-03-15', '2018-03-16',
       '2018-03-17', '2018-03-18', '2018-03-19', '2018-03-20',
       '2018-03-21', '2018-03-22', '2018-03-23', '2018-03-24',
       '2018-03-25', '2018-03-26', '2018-03-27', '2018-03-28',
       '2018-03-29', '2018-03-30', '2018-03-31'], dtype=object)

In [79]:
df_sku['deactivate_date'].unique()

array([nan, '2018-03-23', '2018-03-05', '2018-03-10', '2018-03-12',
       '2018-03-30', '2018-03-09', '2018-03-22', '2018-03-21',
       '2018-03-08', '2018-03-02', '2018-03-06', '2018-03-26',
       '2018-03-14', '2018-03-19', '2018-03-16', '2018-03-28',
       '2018-03-27', '2018-03-11', '2018-03-15', '2018-03-13',
       '2018-03-18', '2018-03-20', '2018-03-24', '2018-03-07',
       '2018-03-29', '2018-03-03', '2018-03-01', '2018-03-17',
       '2018-03-31', '2018-03-25', '2018-03-04'], dtype=object)

In [77]:
df_sku.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31868 entries, 0 to 31867
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   sku_ID           31868 non-null  object
 1   type             31868 non-null  int64
 2   brand_ID         31868 non-null  object
 3   attribute1       31868 non-null  float64
 4   attribute2       31868 non-null  float64
 5   activate_date    3058 non-null   object
 6   deactivate_date  1141 non-null   object
dtypes: float64(2), int64(1), object(4)
memory usage: 1.7+ MB

### Data Cleaning/Processig JD_user_data.csv

In [80]:
df_user.head()

,user_ID,user_level,first_order_month,plus,gender,age,marital_status,education,city_level,purchase_power
0,000089d6a6,1,2017-08,0,F,26-35,S,3,4,3
1,0000babd1f,1,2018-03,0,U,U,U,-1,-1,-1
2,0000bc018b,3,2016-06,0,F,>=56,M,3,2,3
3,0000d0e5ab,3,2014-06,0,M,26-35,M,3,2,2
4,0000dce472,3,2012-08,1,U,U,U,-1,-1,-1

In [84]:
(df_user['gender'].isin(['U']).sum()/df_user.shape[0])*100

12.53384007802352

In [81]:
df_user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457298 entries, 0 to 457297
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_ID            457298 non-null  object
 1   user_level         457298 non-null  int64
 2   first_order_month  457298 non-null  object
 3   plus               457298 non-null  int64
 4   gender             457298 non-null  object
 5   age                457298 non-null  object
 6   marital_status     457298 non-null  object
 7   education          457298 non-null  int64
 8   city_level         457298 non-null  int64
 9   purchase_power     457298 non-null  int64
dtypes: int64(5), object(5)
memory usage: 34.9+ MB

# Rough Work

## üöÆ Rough Work on JD_order_data.csv Table

In [8]:
df_order.head()

,order_ID,user_ID,sku_ID,order_date,order_time,quantity,type,promise,original_unit_price,final_unit_price,direct_discount_per_unit,quantity_discount_per_unit,bundle_discount_per_unit,coupon_discount_per_unit,gift_item,dc_ori,dc_des
0,d0cf5cc6db,0abe9ef2ce,581d5b54c1,2018-03-01,2018-03-01 17:14:25.0,1,2,-,89.0,79.0,0.0,10.0,0.0,0.0,0,4,28
1,7444318d01,33a9e56257,067b673f2b,2018-03-01,2018-03-01 11:10:40.0,1,1,2,99.9,53.9,5.0,41.0,0.0,0.0,0,28,28
2,f973b01694,4ea3cf408f,623d0a582a,2018-03-01,2018-03-01 09:13:26.0,1,1,2,78.0,58.5,19.5,0.0,0.0,0.0,0,28,28
3,8c1cec8d4b,b87cb736cb,fc5289b139,2018-03-01,2018-03-01 21:29:50.0,1,1,2,61.0,35.0,0.0,26.0,0.0,0.0,0,4,28
4,d43a33c38a,4829223b6f,623d0a582a,2018-03-01,2018-03-01 19:13:37.0,1,1,1,78.0,53.0,19.0,0.0,0.0,6.0,0,3,16

### Finding Missing Values üïµÔ∏è

In [10]:
df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549989 entries, 0 to 549988
Data columns (total 17 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   order_ID                    549989 non-null  object
 1   user_ID                     549989 non-null  object
 2   sku_ID                      549989 non-null  object
 3   order_date                  549989 non-null  object
 4   order_time                  549989 non-null  object
 5   quantity                    549989 non-null  int64
 6   type                        549989 non-null  int64
 7   promise                     549989 non-null  object
 8   original_unit_price         549989 non-null  float64
 9   final_unit_price            549989 non-null  float64
 10  direct_discount_per_unit    549989 non-null  float64
 11  quantity_discount_per_unit  549989 non-null  float64
 12  bundle_discount_per_unit    549989 non-null  float64
 13  coupon_discount_per_unit    549989 non-null  float64
 14  gift_item                   549989 non-null  int64
 15  dc_ori                      549989 non-null  int64
 16  dc_des                      549989 non-null  int64
dtypes: float64(6), int64(5), object(6)
memory usage: 71.3+ MB

##### Analysing Object Colums for Miss placed Values üìñüîç

In [30]:
df_obj_order = df_order.select_dtypes(include='object')
df_obj_order.sample(10)

,order_ID,user_ID,sku_ID,order_date,order_time,promise
484218,5bc235dcde,24c5417418,f7280c119d,2018-03-28,2018-03-28 16:57:47.0,3
289907,d16adf092e,d868f812f7,a9109972d1,2018-03-16,2018-03-16 23:56:34.0,-
286939,5c3dcab883,e466d52e92,581d5b54c1,2018-03-16,2018-03-16 15:28:13.0,-
378481,1be0671c6a,88e73f4307,be1809c946,2018-03-23,2018-03-23 11:30:06.0,-
461428,b81ed747ac,f445deb02a,17054160bd,2018-03-27,2018-03-27 12:37:13.0,-
19141,fa009cb88e,3b9bcbd429,a2dbc5e0f7,2018-03-01,2018-03-01 15:18:48.0,-
46843,f2ee0a43a8,e3f953d9dc,7bf34e25f7,2018-03-02,2018-03-02 10:54:39.0,2
327117,62d4c54a3e,ae27f37fa0,067b673f2b,2018-03-19,2018-03-19 20:08:11.0,1
253040,98a4ed3fd6,0ac8b9ee62,8ce2dc2dd0,2018-03-14,2018-03-14 20:54:48.0,-
21231,cb840985aa,a7114f2bd3,4b65db43ac,2018-03-01,2018-03-01 00:10:01.0,1

In [41]:
df_obj_order[df_obj_order['promise'].isin(['-'])]

,order_ID,user_ID,sku_ID,order_date,order_time,promise
0,d0cf5cc6db,0abe9ef2ce,581d5b54c1,2018-03-01,2018-03-01 17:14:25.0,-
11,252f6bbde1,010dc4d911,4fe57b6fb2,2018-03-01,2018-03-01 20:59:13.0,-
18,72153dfa1a,e9a0dab3c8,288dc2722e,2018-03-01,2018-03-01 20:47:49.0,-
21,37327053be,e278593de1,90a8e42962,2018-03-01,2018-03-01 18:32:38.0,-
27,6762f1214d,0be89ca802,867b4f2363,2018-03-01,2018-03-01 21:59:26.0,-
...,...,...,...,...,...,...
549980,a7c31a6da3,ecc9f60096,a9109972d1,2018-03-31,2018-03-31 21:02:09.0,-
549981,ac748a8701,dbbace058c,a9109972d1,2018-03-31,2018-03-31 11:30:16.0,-
549982,f1a1f20e07,6208a6bceb,6cb24edcc6,2018-03-31,2018-03-31 22:06:43.0,-
549984,3ad06b9fbe,a27b3ed4d4,a9109972d1,2018-03-31,2018-03-31 01:22:47.0,-
549987,be3a9414b1,20ba6655f3,2dd6b818ec,2018-03-31,2018-03-31 12:51:18.0,-

In [42]:
df_order.replace('-',np.nan,inplace=True)

In [43]:
df_order.sample(10)

,order_ID,user_ID,sku_ID,order_date,order_time,quantity,type,promise,original_unit_price,final_unit_price,direct_discount_per_unit,quantity_discount_per_unit,bundle_discount_per_unit,coupon_discount_per_unit,gift_item,dc_ori,dc_des
379296,a9e1a44af4,d2825793ae,f843fb960c,2018-03-23,2018-03-23 20:30:51.0,1,2,NaN,0.0,0.0,0.0,0.0,0.0,0.0,1,5,17
361421,99bdb4df93,cfc755e6ed,2523d051fd,2018-03-22,2018-03-22 09:47:43.0,1,1,1,298.0,238.0,60.0,0.0,0.0,0.0,0,9,9
494564,7b4bba8eae,500b7c194d,68c347f03a,2018-03-29,2018-03-29 06:48:12.0,1,2,1,79.0,39.0,0.0,0.0,0.0,40.0,0,5,5
501124,cf11e65e50,97c1932c57,1a92513d9e,2018-03-29,2018-03-29 10:46:39.0,1,2,NaN,0.0,0.0,0.0,0.0,0.0,0.0,1,5,5
303544,8909ffaf9e,7dc9529d00,2e69af1fdf,2018-03-17,2018-03-17 20:18:58.0,1,1,2,170.0,94.0,0.0,76.0,0.0,0.0,0,10,37
62063,f5e7b350e7,aa47505c22,623d0a582a,2018-03-03,2018-03-03 14:34:08.0,1,1,2,78.0,59.0,19.0,0.0,0.0,0.0,0,10,47
49600,c55e3e5622,d1916b210a,dacf9ea2b9,2018-03-02,2018-03-02 13:11:12.0,1,2,NaN,0.0,0.0,0.0,0.0,0.0,0.0,1,4,4
439262,c41182de02,74b01493ed,01c99f44fd,2018-03-26,2018-03-26 06:27:25.0,2,2,NaN,79.0,35.1,40.0,3.9,0.0,0.0,0,10,10
370058,c20de9d644,555f366827,30c282b0d4,2018-03-22,2018-03-22 19:21:13.0,1,2,NaN,0.0,0.0,0.0,0.0,0.0,0.0,1,2,2
111542,dde0724269,d319dc2ff8,0c8653db6f,2018-03-06,2018-03-06 14:19:06.0,1,2,NaN,69.0,29.0,20.0,15.0,0.0,5.0,0,5,5

## üöÆ Rough Work on JD_sku_data.csv Table

In [48]:
df_sku.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31868 entries, 0 to 31867
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   sku_ID           31868 non-null  object
 1   type             31868 non-null  int64
 2   brand_ID         31868 non-null  object
 3   attribute1       31868 non-null  object
 4   attribute2       31868 non-null  object
 5   activate_date    3058 non-null   object
 6   deactivate_date  1141 non-null   object
dtypes: int64(1), object(6)
memory usage: 1.7+ MB

In [24]:
df_obj_sku = df_sku.select_dtypes(include="object")

In [25]:
df_obj_sku.isin(['-']).sum()

sku_ID             0
brand_ID           0
attribute1         0
attribute2         0
activate_date      0
deactivate_date    0
dtype: int64

In [23]:
df_sku.replace('-',np.nan,inplace=True)

## üöÆ Rough Work on JD_user_data.csv Table

In [87]:
df_user

,user_ID,user_level,first_order_month,plus,gender,age,marital_status,education,city_level,purchase_power
0,000089d6a6,1,2017-08,0,F,26-35,S,3,4,3
1,0000babd1f,1,2018-03,0,U,U,U,-1,-1,-1
2,0000bc018b,3,2016-06,0,F,>=56,M,3,2,3
3,0000d0e5ab,3,2014-06,0,M,26-35,M,3,2,2
4,0000dce472,3,2012-08,1,U,U,U,-1,-1,-1
...,...,...,...,...,...,...,...,...,...,...
457293,ffff38690b,1,2018-03,0,U,U,U,-1,-1,-1
457294,ffffa1a495,4,2011-09,1,M,26-35,S,3,1,2
457295,ffffb20ef7,3,2017-11,0,M,36-45,M,2,4,2
457296,ffffc45330,1,2016-04,0,F,26-35,M,-1,-1,-1
457297,ffffe74cfb,1,2017-10,0,M,26-35,M,-1,3,3